# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [5]:
cars1=pd.read_csv('cars1.csv')
cars2=pd.read_csv('cars2.csv')
cars1.head()
cars2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [6]:
cars1=cars1.loc[:,'mpg':'car']
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [7]:
print(cars1.shape)
print(cars2.shape)

(198, 9)
(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [8]:
cars=cars1.append(cars2)
cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
196,44.0,4,97,52,2130,24.6,82,2,vw pickup
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage
198,28.0,4,120,79,2625,18.6,82,1,ford ranger
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [9]:
owners=np.random.randint(15000,73001,size=398,dtype='l')   #dtype='l'???
owners

array([42654, 24684, 23498, 68831, 47649, 22749, 53536, 29787, 36298,
       72042, 28220, 39151, 72583, 32384, 42767, 70877, 24205, 70472,
       63163, 63879, 54045, 55471, 46384, 35640, 24801, 57144, 45103,
       23636, 58791, 49170, 62828, 21867, 36089, 51178, 43639, 69903,
       29470, 49299, 29566, 65790, 22849, 24049, 68608, 71935, 44285,
       33906, 35696, 25918, 53376, 32485, 70140, 58239, 24787, 50780,
       72923, 27327, 42703, 60857, 53127, 40410, 17563, 56039, 18713,
       52845, 39093, 42419, 47040, 25561, 43289, 70596, 40709, 34873,
       15953, 28976, 16935, 71295, 40408, 44740, 70457, 60440, 57015,
       16432, 19049, 72938, 55148, 58073, 53998, 64712, 16506, 27132,
       24141, 54399, 54783, 58938, 35585, 31632, 37071, 66718, 70033,
       44760, 23251, 58159, 71141, 33097, 45314, 41049, 36125, 71796,
       59359, 63891, 52030, 47248, 42731, 64351, 51218, 23812, 32978,
       34136, 22454, 27789, 61232, 38168, 27902, 24133, 49458, 62444,
       47058, 33171, 38241, 40284, 44810, 49421, 30226, 46341, 32112,
       42923, 29303, 29344, 61516, 62248, 69498, 21071, 24465, 52620,
       64612, 19654, 58340, 56969, 71676, 31728, 42093, 47030, 25903,
       67352, 19943, 30382, 52496, 42444, 63785, 26311, 22444, 55633,
       50124, 32374, 24739, 66416, 67332, 21920, 31295, 37362, 60919,
       42881, 15933, 72210, 24813, 48350, 29410, 61404, 31781, 57331,
       40653, 35136, 45238, 40728, 70745, 24278, 64659, 71928, 48484,
       21760, 37020, 31096, 48907, 18592, 46465, 47232, 64636, 70758,
       48012, 59846, 68100, 48875, 19495, 69077, 69817, 50815, 62990,
       39921, 29510, 21459, 41880, 69929, 27598, 58415, 36457, 68418,
       32410, 68055, 53926, 58696, 49562, 65834, 43052, 34150, 58761,
       51149, 46883, 56707, 28894, 70520, 57569, 69068, 68610, 20575,
       51776, 18519, 68276, 23801, 64268, 16090, 47288, 54577, 66755,
       30816, 23892, 52970, 43331, 28787, 35223, 36970, 60886, 58938,
       70747, 46298, 36326, 59335, 46269, 28415, 64465, 18900, 72870,
       69398, 16808, 16059, 15512, 42002, 70829, 30566, 19976, 66293,
       21785, 23273, 33787, 37059, 23465, 16284, 36254, 43486, 35854,
       58676, 66520, 65346, 65169, 42626, 68658, 37567, 26644, 19852,
       22623, 20777, 57319, 19775, 44198, 64071, 36747, 52276, 72321,
       56320, 57917, 69540, 41956, 72637, 43728, 46841, 26953, 33733,
       68313, 56276, 68168, 55512, 23148, 35959, 43166, 17808, 66865,
       30658, 46189, 71337, 59030, 71780, 36966, 16618, 26875, 70600,
       19101, 72634, 43013, 28702, 24940, 67221, 35985, 24436, 67803,
       30609, 70165, 33971, 72636, 46186, 60426, 29051, 15035, 36965,
       40261, 52496, 24149, 27957, 27424, 54936, 27173, 17953, 65451,
       15258, 72798, 31935, 42061, 49807, 71395, 72769, 19094, 49723,
       35359, 42283, 70196, 54928, 30037, 40883, 21362, 40490, 32461,
       72031, 24110, 69686, 64101, 61994, 15185, 57358, 36307, 16583,
       72920, 20888, 33374, 70294, 55533, 56100, 71695, 68229, 23109,
       28601, 47670, 64234, 21420, 55901, 23877, 59866, 27950, 68661,
       54304, 19498])

### Step 8. Add the column owners to cars

In [10]:
cars['owners']=owners
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,42654
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,24684
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,23498
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,68831
4,17.0,8,302,140,3449,10.5,70,1,ford torino,47649